HTML & CSS - Design and Build Websites/008.Extra Markup/008.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-16 Fri 21:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ch.8 Extra Markup</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Ch.8 Extra Markup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org97d2c7f">Navigation</a></li>
<li><a href="#org77f2129">Notes</a>
<ul>
<li><a href="#orgf5720be">Section 8.1: The Evolution of HTML</a></li>
</ul>
</li>
<li><a href="#org18a65cc">Keywords</a></li>
<li><a href="#org8b1cc26">Questions</a></li>
<li><a href="#org7b590cc">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org97d2c7f" class="outline-2">
<h2 id="org97d2c7f">Navigation</h2>
<div class="outline-text-2" id="text-org97d2c7f">
<p>
<b>Home</b>: HTML &amp; CSS - Design and Build Websites [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites">github</a>]
</p>

<p>
<b>Prev</b>: Ch.7 Forms [<a href="../007.Forms/007.000.Notes.html">html</a>] [<a href="../007.Forms/007.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/007.Forms">github</a>]
</p>

<p>
<b>Next</b>: Ch.9 Flash, Video &amp; Audio [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">html</a>] [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/009.Flash%2C%20Video%20%26%20Audio">github</a>]
</p>
</div>
</div>

<div id="outline-container-org77f2129" class="outline-2">
<h2 id="org77f2129">Notes</h2>
<div class="outline-text-2" id="text-org77f2129">
</div>
<div id="outline-container-orgf5720be" class="outline-3">
<h3 id="orgf5720be">Section 8.1: The Evolution of HTML</h3>
<div class="outline-text-3" id="text-orgf5720be">
<ul class="org-ul">
<li>HTML4 was released in 1997 and although new elements were added in HTML5 many of them have been available since HTML4</li>
<li>Some presentational elements from HTML4 have been deprecated because almost all presentational elements can be replicated using CSS</li>
<li>In 1998 XML was introduced allowing people to write their own markup languages which had stricter rules than HTML</li>
<li>Thus it decided that HTML4 should be reformulated to follow the fules of XML and it was renamed to XHTML and thus XHTML 1.0 was released in 2000</li>
<li>Since XHTML was conforming to XML rules it worked seamlessly with programs that create and process XML documents and it worked well with other data formats such as SVG which was written in XML</li>
<li>There are other formats such as MathML and CML that also use XML</li>
<li>To help the transition there were 3 flavors of XHTML
<ol class="org-ol">
<li>Strict XHTML 1.0: Authors had to follow the rules to the letter</li>
<li>Transitional XHTML 1.0: Authors could still follow older practices, elements, and attributes that may be removed in the future</li>
<li>XHTML 1.0 Frameset: Authors could partition a browser window into several "frames" and each frame would hold a different HTML page</li>
</ol></li>
<li>XHTML 1.0 is based off HTML4</li>
<li>HTML5 was first published in 2008</li>
<li>In 2014 the W3C (World Wide Wide Consortium - an international standards organization for the World Wide Web) finally issued HTML5 as a W3C recommendation</li>
<li>HTML5 has since replaced both HTML4 and XHTML 1.0 with new elements, new attributes, and a new way to web develop</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org18a65cc" class="outline-2">
<h2 id="org18a65cc">Keywords</h2>
<div class="outline-text-2" id="text-org18a65cc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8b1cc26" class="outline-2">
<h2 id="org8b1cc26">Questions</h2>
<div class="outline-text-2" id="text-org8b1cc26">
<ul class="org-ul">
<li><b>Q</b>: What happened to XHTML?
<ul class="org-ul">
<li><a href="https://softwareengineering.stackexchange.com/questions/149839/is-xhtml5-dead-or-is-it-just-an-synonym-of-html5">StackExchange Answer</a></li>
<li><a href="https://retrocomputing.stackexchange.com/questions/29933/why-did-xml-lose-out-to-xhtml-then-html-5-on-the-web">Another StackExchange Answer</a></li>
<li><a href="https://www.reddit.com/r/webdev/comments/410s0a/is_xhtml_dead/">Reddit Discussion</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7b590cc" class="outline-2">
<h2 id="org7b590cc">Summary</h2>
</div>
</div>
</body>
</html>
